Thanks @Affan172  for opening this issue. I have tried to reproduce it with v4.49.0. But things are working fine for me:

```
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_key_vault.example will be created
  + resource "azurerm_key_vault" "example" {
      + access_policy                 = (known after apply)
      + id                            = (known after apply)
      + location                      = "eastus"
      + name                          = "example-kv"
      + public_network_access_enabled = true
      + rbac_authorization_enabled    = true
      + resource_group_name           = "example-rg"
      + sku_name                      = "standard"
      + soft_delete_retention_days    = 90
      + tenant_id                     = "***"
      + vault_uri                     = (known after apply)

      + network_acls (known after apply)
    }

  # azurerm_resource_group.test will be created
  + resource "azurerm_resource_group" "test" {
      + id       = (known after apply)
      + location = "australiaeast"
      + name     = "acctestRG-backup-lucia"
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

`enable_rbac_authorization` is deprecated in favour of `rbac_authorization_enabled` since v4.42.0. The documentation is consistent with the code base. Could you please double check which AzureRM version you're using?